Revit 2027 API
EnergyDataSettings.CheckBuildingHVACSystem Method
 Checks that the building HVAC system falls within an appropriate range.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool CheckBuildingHVACSystem(
	gbXMLBuildingHVACSystem buildingHVACSystem
)
Public Shared Function CheckBuildingHVACSystem (
	buildingHVACSystem As gbXMLBuildingHVACSystem
) As Boolean
public:
static bool CheckBuildingHVACSystem(
	gbXMLBuildingHVACSystem buildingHVACSystem
)
static member CheckBuildingHVACSystem :
        buildingHVACSystem : gbXMLBuildingHVACSystem -> bool
Parameters
buildingHVACSystem gbXMLBuildingHVACSystem
 The building HVAC system to be checked.
Return Value
Boolean
 True if the building HVAC system falls within an appropriate range, false otherwise.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace